Core/src/Documents/СписаниеБалловЛояльности/СписаниеБалловЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеБалловЛояльности</name>
  <comment>ONESOFT-3565</comment>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.БалыЛояльности</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <type>
      <types>CatalogRef.КартыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КартыЛояльности</name>
    <attributes>
      <name>КартаЛояльности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/СписаниеБалловЛояльности/ManagerModule.bsl
#Область ИнициализацияДаных

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапросаИнициализироватьДанныеДокумента());
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеБалловЛояльности);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ВалютаНакладной", ДокументСсылкаСписаниеБалловЛояльности.ВалютаДокумента);
	Запрос.УстановитьПараметр("Контрагент", ДокументСсылкаСписаниеБалловЛояльности.Контрагент);
	
	Запрос.УстановитьПараметр("НаДату", ДокументСсылкаСписаниеБалловЛояльности.Дата);
	
	
	Запрос.ВыполнитьПакет();

	СформироватьТаблицаБалыЛояльность(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства);
	СформироватьТаблицаХозрасчетный(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

Функция ТекстЗапросаИнициализироватьДанныеДокумента()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаРеглСрезПоследних.ВалютаУправленческая КАК ВалютаУправленческая,
	|	УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте,
	|	УчетнаяПолитикаРеглСрезПоследних.ВидНадогаДляСчетовНДС КАК ВидНадогаДляСчетовНДС,
	|	УчетнаяПолитикаРеглСрезПоследних.Организация КАК Организация,
	|	УчетнаяПолитикаРеглСрезПоследних.КартыЛояльности_СчетЗатратДляБалловРегл КАК КартыЛояльности_СчетЗатратДляБалловРегл,
	|	УчетнаяПолитикаРеглСрезПоследних.СчетДляНеоперационныхДоходовОтБалловРегл КАК СчетДляНеоперационныхДоходовОтБалловРегл,
	|	УчетнаяПолитикаРеглСрезПоследних.СчетДляПредоплаченныхРасходовРегл КАК СчетДляПредоплаченныхРасходовРегл
	|ПОМЕСТИТЬ втУчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&НаДату, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Курс = 0
	|			ТОГДА 1
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ втКурсУпрВалюты
	|ИЗ
	|	втУчетнаяПолитика КАК втУчетнаяПолитика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсыВалютСрезПоследних
	|		ПО втУчетнаяПолитика.ВалютаУправленческая = КурсыВалютСрезПоследних.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеБалловЛояльности.Контрагент КАК Контрагент,
	|	СписаниеБалловЛояльности.Договор КАК Договор,
	|	СписаниеБалловЛояльности.Организация КАК Организация,
	|	СписаниеБалловЛояльности.Подразделение КАК СтруктурнаяЕдиница,
	|	СписаниеБалловЛояльности.Автор КАК Автор,
	|	СписаниеБалловЛояльности.КартаЛояльности КАК КартаЛояльности,
	|	СписаниеБалловЛояльности.КартаЛояльности.Владелец.СчетУчетаРегл КАК КартаЛояльности_СчетУчетаРегл,
	|	СписаниеБалловЛояльности.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СписаниеБалловЛояльности.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	СписаниеБалловЛояльности.ОсновнаяСтавкаНДС КАК ОсновнаяСтавкаНДС,
	|	СписаниеБалловЛояльности.ВалютаДокумента КАК ВалютаДокумента,
	|	СписаниеБалловЛояльности.Кратность КАК Кратность,
	|	СписаниеБалловЛояльности.Курс КАК Курс,
	|	СписаниеБалловЛояльности.Ссылка КАК Ссылка,
	|	СписаниеБалловЛояльности.Дата КАК Дата
	|ПОМЕСТИТЬ ВременнаяТаблицаШапкаДокумента
	|ИЗ
	|	Документ.СписаниеБалловЛояльности КАК СписаниеБалловЛояльности
	|ГДЕ
	|	СписаниеБалловЛояльности.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеБалловЛояльностиКартыЛояльности.Всего - СписаниеБалловЛояльностиКартыЛояльности.СуммаНДС КАК СуммаБезНДС,
	|	СписаниеБалловЛояльностиКартыЛояльности.СуммаНДС КАК СуммаНДС,
	|	СписаниеБалловЛояльностиКартыЛояльности.Всего КАК Всего,
	|	ВременнаяТаблицаШапкаДокумента.КартаЛояльности КАК КартаЛояльности,
	|	ВременнаяТаблицаШапкаДокумента.КартаЛояльности.Владелец.СчетУчетаРегл КАК КартаЛояльности_СчетУчетаРегл,
	|	ВременнаяТаблицаШапкаДокумента.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаШапкаДокумента.Организация КАК Организация,
	|	ВременнаяТаблицаШапкаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаШапкаДокумента.Договор КАК Договор,
	|	ВременнаяТаблицаШапкаДокумента.Дата КАК Дата,
	|	втУчетнаяПолитика.ВидНадогаДляСчетовНДС КАК ВидНадогаДляСчетовНДС,
	|	втУчетнаяПолитика.КартыЛояльности_СчетЗатратДляБалловРегл КАК КартыЛояльности_СчетЗатратДляБалловРегл,
	|	втУчетнаяПолитика.СчетДляНеоперационныхДоходовОтБалловРегл КАК СчетДляНеоперационныхДоходовОтБалловРегл,
	|	втУчетнаяПолитика.СчетДляПредоплаченныхРасходовРегл КАК СчетДляПредоплаченныхРасходовРегл
	|ПОМЕСТИТЬ ВременнаяТаблицаТабличнаяЧасть
	|ИЗ
	|	ВременнаяТаблицаШапкаДокумента КАК ВременнаяТаблицаШапкаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеБалловЛояльности.КартыЛояльности КАК СписаниеБалловЛояльностиКартыЛояльности
	|		ПО ВременнаяТаблицаШапкаДокумента.Ссылка = СписаниеБалловЛояльностиКартыЛояльности.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУчетнаяПолитика КАК втУчетнаяПолитика
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СписаниеБалловЛояльностиКартыЛояльности.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура СформироватьТаблицаБалыЛояльность(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства)

 	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
    "ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаТабличнаяЧасть.Дата КАК Период,
	|	ВременнаяТаблицаТабличнаяЧасть.Организация КАК Организация,
	|	ВременнаяТаблицаТабличнаяЧасть.Всего КАК Количество,
	|	ВременнаяТаблицаТабличнаяЧасть.Всего КАК Сумма,
	|	ВременнаяТаблицаТабличнаяЧасть.СуммаНДС КАК СуммаНДС,
	|	ВременнаяТаблицаТабличнаяЧасть.КартаЛояльности КАК КартаЛояльности,
	|	ВременнаяТаблицаТабличнаяЧасть.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаТабличнаяЧасть.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаТабличнаяЧасть КАК ВременнаяТаблицаТабличнаяЧасть";

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБалыЛояльности", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства)

 	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
    "ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
    |	ВременнаяТаблицаТабличнаяЧасть.Дата КАК Период,
    |	ВременнаяТаблицаТабличнаяЧасть.Организация КАК Организация,
    |	ВременнаяТаблицаТабличнаяЧасть.СуммаНДС КАК Сумма,
    |	ВременнаяТаблицаТабличнаяЧасть.ВидНадогаДляСчетовНДС КАК ВидНалога
    |ИЗ
    |	ВременнаяТаблицаТабличнаяЧасть КАК ВременнаяТаблицаТабличнаяЧасть";
    
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства)

 	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =   
    "ВЫБРАТЬ
    |	1 КАК НомерСтроки,
    |	ВременнаяТаблицаТабличнаяЧасть.Дата КАК Период,
    |	ВременнаяТаблицаТабличнаяЧасть.Организация КАК Организация,
    |	ВременнаяТаблицаТабличнаяЧасть.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
    |	ВременнаяТаблицаТабличнаяЧасть.Всего КАК СуммаДоходов,
    |	0 КАК СуммаРасходов,
    |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ОсновноеНаправление) КАК НаправлениеДеятельности,
    |	&СодержаниеПроводки1 КАК СодержаниеПроводки,
    |	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ВнеоперационныйДоходОтБаллов) КАК ХозяйственнаяОперация,
    |	ВременнаяТаблицаТабличнаяЧасть.СчетДляНеоперационныхДоходовОтБалловРегл  КАК СчетУчетаРегл
    |ИЗ
    |	ВременнаяТаблицаТабличнаяЧасть КАК ВременнаяТаблицаТабличнаяЧасть
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2,
    |	ВременнаяТаблицаТабличнаяЧасть.Дата,
    |	ВременнаяТаблицаТабличнаяЧасть.Организация,
    |	ВременнаяТаблицаТабличнаяЧасть.СтруктурнаяЕдиница,
    |	0,
    |	ВременнаяТаблицаТабличнаяЧасть.СуммаНДС,
    |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ОсновноеНаправление),
    |	&СодержаниеПроводки2,
    |	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ПредоплаченныйРасходНДСпоСписаннымБаллам),
    |	ВременнаяТаблицаТабличнаяЧасть.КартыЛояльности_СчетЗатратДляБалловРегл
    |ИЗ
    |	ВременнаяТаблицаТабличнаяЧасть КАК ВременнаяТаблицаТабличнаяЧасть
    |ГДЕ
    |	ВременнаяТаблицаТабличнаяЧасть.СуммаНДС <> 0";
	
	Запрос.УстановитьПараметр("СодержаниеПроводки1",НСтр("ka='არასაოპერაციო შემოსავალი ქულებიდან'; ru='Внеоперационный доход от баллов';en='Внеоперационный доход от баллов'"));
	Запрос.УстановитьПараметр("СодержаниеПроводки2",НСтр("ka='ჩამოწერილ ქულებზე წინასწარგადახდილი დღგ-ს ხარჯი'; ru='Предоплаченный расход НДС по списанным баллам';en='Предоплаченный расход НДС по списанным баллам'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры 

Процедура СформироватьТаблицаХозрасчетный(ДокументСсылкаСписаниеБалловЛояльности, СтруктураДополнительныеСвойства)

 	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
    "ВЫБРАТЬ
	|	1 как НомерСтроки,
    |	ВременнаяТаблицаТабличнаяЧасть.Дата КАК Период,
    |	ВременнаяТаблицаТабличнаяЧасть.Организация КАК Организация,
    |	ВременнаяТаблицаТабличнаяЧасть.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
    |	ВременнаяТаблицаТабличнаяЧасть.Всего КАК Сумма,
    |	ВременнаяТаблицаТабличнаяЧасть.КартаЛояльности_СчетУчетаРегл КАК СчетДт,
    |	ВременнаяТаблицаТабличнаяЧасть.СчетДляНеоперационныхДоходовОтБалловРегл КАК СчетКт,
	|	0 КАК СуммаВалДт,
    |	0 КАК СуммаВалКт,
    
    |	""Контрагенты"" КАК ВидСубконтоДт1,
    |	""Договоры"" КАК ВидСубконтоДт2,
    |	"""" КАК ВидСубконтоДт3,
    |	""Подразделения"" КАК ВидСубконтоКт1,
    |	""Контрагенты"" КАК ВидСубконтоКт2,
    |	"""" КАК ВидСубконтоКт3,
    |	ВременнаяТаблицаТабличнаяЧасть.Контрагент КАК СубконтоДт1,
    |	ВременнаяТаблицаТабличнаяЧасть.Договор КАК СубконтоДт2,
    |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
    |	ВременнаяТаблицаТабличнаяЧасть.СтруктурнаяЕдиница КАК СубконтоКт1,
    |	ВременнаяТаблицаТабличнаяЧасть.Контрагент КАК СубконтоКт2,
    |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	&СодержаниеПроводки1 как Содержание
    |ИЗ
    |	ВременнаяТаблицаТабличнаяЧасть КАК ВременнаяТаблицаТабличнаяЧасть
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	|	2,
    |	ВременнаяТаблицаТабличнаяЧасть.Дата,
    |	ВременнаяТаблицаТабличнаяЧасть.Организация,
    |	ВременнаяТаблицаТабличнаяЧасть.СтруктурнаяЕдиница,
    |	ВременнаяТаблицаТабличнаяЧасть.СуммаНДС,
    |	ВременнаяТаблицаТабличнаяЧасть.КартыЛояльности_СчетЗатратДляБалловРегл,
    |	ВременнаяТаблицаТабличнаяЧасть.СчетДляПредоплаченныхРасходовРегл,
    |	0,
    |	0,
    |	""Подразделения"",
    |	""Контрагенты"",
    |	"""",
    |	""Контрагенты"",
    |	""Договоры"",
    |	"""",
    |	ВременнаяТаблицаТабличнаяЧасть.СтруктурнаяЕдиница,
    |	ВременнаяТаблицаТабличнаяЧасть.Контрагент,
    |	НЕОПРЕДЕЛЕНО,
    |	ВременнаяТаблицаТабличнаяЧасть.Контрагент,
    |	ВременнаяТаблицаТабличнаяЧасть.Договор,
	|	НЕОПРЕДЕЛЕНО,
	|	&СодержаниеПроводки2
    |ИЗ
    |	ВременнаяТаблицаТабличнаяЧасть КАК ВременнаяТаблицаТабличнаяЧасть
    |ГДЕ
    |	ВременнаяТаблицаТабличнаяЧасть.СуммаНДС <> 0";
	Запрос.УстановитьПараметр("СодержаниеПроводки1",НСтр("ka='არასაოპერაციო შემოსავალი ქულებიდან'; ru='Внеоперационный доход от баллов';en='Внеоперационный доход от баллов'"));
	Запрос.УстановитьПараметр("СодержаниеПроводки2",НСтр("ka='ჩამოწერილ ქულებზე წინასწარგადახდილი დღგ-ს ხარჯი'; ru='Предоплаченный расход НДС по списанным баллам';en='Предоплаченный расход НДС по списанным баллам'"));
	
 	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
